БухЭксп/Reports/CW_КонтрольСведенийОДоговорахСНерезидентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_КонтрольСведенийОДоговорахСНерезидентами</Name>
		</Properties>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДоходыНерезидентовСписокСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоходыНерезидентовСписокСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоходыНерезидентовСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоходыНерезидентовСведенияОДоходах</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеРаздел42</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеТабличногоДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ДоходыНерезидентовЯчейкиРаздела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Reports/CW_КонтрольСведенийОДоговорахСНерезидентами/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,  КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	НачалоПериода 	= МакетКомпоновки.ЗначенияПараметров.НачалоПериода.Значение;
	КонецПериода 	= МакетКомпоновки.ЗначенияПараметров.КонецПериода.Значение;
	
	СведенияОДоходах = ПолучитьСведенияОДоходах(НачалоПериода, КонецПериода);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ВнешнийНабор", СведенияОДоходах);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
КонецПроцедуры   

Функция ПолучитьСведенияОДоходах(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1)) КАК ПризнакНаличияВедомостиБанковскогоКонтроля,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(22)) КАК НомерВедомостиБанковскогоКонтроля,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(2)) КАК КодДохода,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(5)) КАК СимволДохода,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1)) КАК ОснованиеОсвобожденияОтИсчисленияИУдержанияНалога
	|ИЗ
	|	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах";   
	
	Запрос.Выполнить();
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();       
	
	АктуальныйПриказ 				= CW_ДоходыНерезидентовДополнительный.ПолучитьАктуальныйПриказ(КонецПериода);
	ИменаПроверяемыхРеквизтов		= CW_ДоходыНерезидентовДополнительный.ПолучитьИменаПроверяемыхРеквизтов();  
	ИменаДополнительныхРеквизитов 	= ИменаПроверяемыхРеквизтов.Получить(АктуальныйПриказ.ИмяПредопределенныхДанных);
	
	мДопСвойства = Новый Массив;
	Для Каждого ИмяРеквизита из ИменаДополнительныхРеквизитов Цикл
		НайденнаяСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", ИмяРеквизита);  
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			мДопСвойства.Добавить(НайденнаяСсылка);
		КонецЕсли;
	КонецЦикла;
	
	РоссийскийРубль = Справочники.Валюты.НайтиПоКоду("643");
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры); 
	
	мСчета = Новый Массив;
	мСчета.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
	мСчета.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСписокСчетов.Счет КАК Счет
	               |ПОМЕСТИТЬ ВТ_СчетаУчета
	               |ИЗ
	               |	РегистрСведений.CW_ДоходыНерезидентовСписокСчетов КАК CW_ДоходыНерезидентовСписокСчетов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Нерезиденты
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ЛОЖЬ
	               |	И Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ХозрасчетныйОбороты.Организация КАК Организация,
	               |	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОбороты.Субконто2 КАК ДоговорКонтрагента,
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство, НЕОПРЕДЕЛЕНО) КАК Свойство,
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул, """") КАК ИдентификаторДляФормул,
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Значение, НЕОПРЕДЕЛЕНО) КАК Значение
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Регистратор,
	               |			Счет В
	               |				(ВЫБРАТЬ
	               |					ВТ_СчетаУчета.Счет КАК Счет
	               |				ИЗ
	               |					ВТ_СчетаУчета КАК ВТ_СчетаУчета),
	               |			&ВидыСубконто,
	               |			Субконто1 В
	               |					(ВЫБРАТЬ
	               |						ВТ_Нерезиденты.Ссылка КАК Ссылка
	               |					ИЗ
	               |						ВТ_Нерезиденты КАК ВТ_Нерезиденты)
	               |				И Субконто1 <> КорСубконто1
	               |				И Субконто2 <> КорСубконто2,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах
	               |		ПО ХозрасчетныйОбороты.Регистратор = CW_ДоходыНерезидентовСведенияОДоходах.Документ
	               |			И ХозрасчетныйОбороты.Организация = CW_ДоходыНерезидентовСведенияОДоходах.Организация
	               |			И ХозрасчетныйОбороты.Субконто1 = CW_ДоходыНерезидентовСведенияОДоходах.Контрагент
	               |			И ХозрасчетныйОбороты.Субконто2 = CW_ДоходыНерезидентовСведенияОДоходах.ДоговорКонтрагента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	               |		ПО ХозрасчетныйОбороты.Субконто2 = ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство В(&мДопСвойства)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Субконто2,
	               |	ХозрасчетныйОбороты.Субконто1,
	               |	ХозрасчетныйОбороты.Организация,
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство, НЕОПРЕДЕЛЕНО),
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул, """"),
	               |	ЕСТЬNULL(ДоговорыКонтрагентовДополнительныеРеквизиты.Значение, НЕОПРЕДЕЛЕНО)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Организация,
	               |	CW_ДоходыНерезидентовСведенияОДоходах.Контрагент,
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ДоговорКонтрагента,
	               |	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство,
	               |	ДоговорыКонтрагентовДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул,
	               |	ДоговорыКонтрагентовДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.CW_ДоходыНерезидентовСведенияОДоходах КАК CW_ДоходыНерезидентовСведенияОДоходах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыКонтрагентовДополнительныеРеквизиты
	               |		ПО CW_ДоходыНерезидентовСведенияОДоходах.ДоговорКонтрагента = ДоговорыКонтрагентовДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	CW_ДоходыНерезидентовСведенияОДоходах.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ДоходыНерезидентовСведенияОДоходах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.Организация КАК Организация,
	               |	ВТ_Данные.Контрагент КАК Контрагент,
	               |	ВТ_Данные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВТ_Данные.Свойство КАК Свойство,
	               |	ВТ_Данные.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
	               |	ВТ_Данные.Значение КАК Значение
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Данные.ИдентификаторДляФормул,
	               |	ВТ_Данные.Контрагент,
	               |	ВТ_Данные.Свойство,
	               |	ВТ_Данные.Организация,
	               |	ВТ_Данные.Значение,
	               |	ВТ_Данные.ДоговорКонтрагента
	               |ИТОГИ ПО
	               |	Организация,
	               |	Контрагент,
	               |	ДоговорКонтрагента";   
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто); 
	Запрос.УстановитьПараметр("мСчета",			мСчета); 
	Запрос.УстановитьПараметр("мДопСвойства",	мДопСвойства); 
	
	РезультатЗапроса = Запрос.Выполнить();  
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл
			ВыборкаДоговорКонтрагента = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДоговорКонтрагента.Следующий() Цикл
				НоваяСтрока = ТаблицаЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДоговорКонтрагента);   
				
				ВыборкаДетали = ВыборкаДоговорКонтрагента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
				Пока ВыборкаДетали.Следующий() Цикл
					Если ПустаяСтрока(ВыборкаДетали.ИдентификаторДляФормул) Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрока[ВыборкаДетали.ИдентификаторДляФормул] =  ВыборкаДетали.Значение;   
				КонецЦикла; 
			КонецЦикла; 		
		КонецЦикла; 		
	КонецЦикла;    
	 
    Возврат ТаблицаЗапроса;
	
КонецФункции
